Grafico de arquitectura de computadoras pasado a mermaid
